tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/Allrun-parallel
#!/bin/sh

cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

decomposePar -region wallFilmRegion >& log.decomposePar.wallFilmRegion
decomposePar >& log.decomposePar.primaryRegion

runParallel reactingParcelFilmFoam 4

reconstructPar -region wallFilmRegion >& log.reconstructPar.wallFilmRegion
reconstructPar >& log.reconstructPar.primaryRegion

