tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/constant/foam.inp
species
(
    O2
    H2O
    N2
);

reactions
{}

